FROM node:14.16.1-alpine as builder
# มีส่วนต่อหลังมาว่า as builder ความหมายของมันก็คือ ตั้งแต่ส่วนประกาศ image ที่ใช้นี้ไปจนกว่าจะเจอการเรียกใช้ image ตัวใหม่จะถือว่าอยู่ใน block ของ builder

WORKDIR '/app'

COPY package.json .

RUN npm install

COPY . .

RUN npm run prod
# ถ้าใช้ CMD มันจะไปติดขั้นตอน COPY ของ nginx เพราะมันเป็น default command ของ container นั้น ๆ มีได้อันเดียว และมันจะรันเป็นคำสั่งสุดท้าย ประเด็นมันอยู่ตรงนี้แหละ นั่นหมายความว่า หลังจาก COPY . . ไปแล้ว มันจะข้ามไปอันต่อไป ซึ่งในที่นี้คือ FROM nginx ก่อน แล้วก็ทำที่เหลือหลังจากนั้นให้หมด ก่อนย้อนกลับมาที่ CMD ดังนั้นมันเลยยังไม่ได้ npm run build มันเลยไปติด COPY ของ nginx เพราะไม่มี /build ให้ copy

# ถ้าไม่ใส่ข้างล่าง ไฟล์มันจะใหญ่ แล้วก็รันไม่ขึ้น แต่ยังเข้าได้ด้วย port 80
FROM nginx
# ไม่ได้ใส่ as ลงไปเพราะว่า นี่เป็น step สุดท้ายแล้วไม่ได้ต้องการที่จะเรียกใช้ image นี้ที่ step อื่นต่อ
COPY --from=builder /app/build /usr/share/nginx/html

# COPY --from=builder /app/build /var/www/html/website
# ถ้าใช้แค่อันนี้แล้ว comment อันบน แล้วใน site_fe.conf เปลี่ยนเป็น path นี้ port 80 จะเป็น Welcome to nginx! ซึ่งน่าจะเป็นเพราะ nginx มันหาไฟล์ไม่เจอ เพราะ /usr/share/nginx/html คือ path default ที่ nginx จะมาเรียกใช้เมื่อมีการ request content
# ถ้าใช้แค่อันนี้แล้ว comment อันบน แล้วใน site_fe.conf เปลี่ยนเป็น path นี้ port 80 จะ 500

# สุดท้ายก็เป็นการ start nginx แต่ว่าไม่ได้ใส่คำสั่ง start เข้าไปเป็นเพราะว่า คำสั่ง default ของ image nginx นั้นเป็นการ start nginx อยู่แล้วเลยไม่จำเป็นต้องไป overide มัน

# เมื่อไฟล์นี้ถูกรัน เราตั้งค่าว่า เออเราจะทำอะไรโน่นนี่นั่นใน /app ของใน docker แล้วเราก็ทำโน่นทำนี่ไปตามกระบวนการที่เราตั้ง แล้วพอมันรัน npm run build มันก็จะสร้างโฟล์เดอร์ /build ขึ้นมา อยู่ภายใต้ WORKDIR หรือก็คือที่ที่เราตั้งว่าจะทำอะไรโน่นนี่นั่นในนั้น ซึ่งในนี่นี้ก็คือ /app ก็ก่อให้เกิด /app/build ขึ้นมา แล้วต่อมา ก็เรียกใช้ image nginx โดยให้ก็อปสิ่งที่อยู่ใน /app/build (ของ docker. ให้มองว่าใน docker ก็เหมือนคอมเครื่องนึง มันก็แค่ก็อปไฟล์จากที่นึงไปใส่อีกที่ของเครื่องนั้นๆ เหมือนเครื่องคอมปกติ ไม่ได้ยุ่งอะไรกับไฟล์บนคอมจริงๆของเรา เพราะคำสั่งทั้งหมดนี้รันอยู่ใน docker ซึ่งเปรียบเสมือนเครื่องคอมอีกเครื่องนั่นเอง) ซึ่งก็คือ ไฟล์ build ที่เราสร้างขึ้นมาจากคำสั่ง npm run build ที่เรารันก่อนหน้านั่นเอง ไปไว้ใน /usr/share/nginx/html ซึ่งเป็น default root ของ nginx ที่มันจะไปหาและรัน html จากในนั้น